Repository: gdumee/LISA-PLUGINS-Shopping
Catalog: lisa/plugins/Shopping/lang/*/LC_MESSAGES/shopping.po
Languages: fr

source: then
fr: (10,", puis "),

source: cant create without name
fr: (5, "je ne peux pas créer une liste sans thème"),(10, "Je ne peux pas créer une liste sans nom"),(10, "J'ai besoin d'un nom pour faire une nouvelle liste"),(10, "J'ai besoin d'un nom pour créer une nouvelle liste"),(10, "J'ai besoin d'un nom pour créer une liste"),(10, "Il faut un nom pour créer une nouvelle liste"),(10, "Il faut un nom pour faire une nouvelle liste"),

source: duplicate name
fr: (10, "Cette liste existe déjà."),(10, "Cette liste est déjà existante."),(10, "Je ne peux pas recréer une liste existante."),(10, "Une liste avec ce nom existe déjà."),(10, "Il existe déjà Une liste avec ce nom."),

source: create list
fr: (10, "Je viens de créer cette nouvelle liste."),(10, "Je viens de créer la liste {0}."),(6, "C est fait."),(8, "Vous avez une nouvelle liste."),(10, "La liste {0} est créée."),

source: no exiting name
fr: (10, "Cette liste n'existe pas."),(10, "Ce nom de liste n'existe pas."),(10, "Il n'existe aucune liste avec ce nom."),(10, "Il n'y a pas de liste avec ce nom."),(10, "Il n'existe aucune liste correspondante."),

source: delete list
fr: (10, "Je viens de supprimer la liste."),(10, "Je viens de supprimer la liste {0}."),(10, "J'efface la liste."),(7, "C est fait."),(10, "La liste {0} est supprimée."),(10, "La liste {0} n'existe plus."),

source: no product to delete
fr: (10, "{sproduct} n'existe pas dans {slist}."),(10, "Ce produit n'existe pas."),(10, "Ce produit n'existe pas dans {slist}."),(10, "Ce produit n'existe pas cette liste."),(10, "{slist} ne contient pas ce produit."),(10, "{slist} ne contient pas {sproduct}."),

source: product deleted
fr: (10, "Le produit a été enlevé de la liste."),(10, "Le produit a été supprimé de la liste."),(10, "{sproduct} a été supprimé de la liste."),(10, "J'ai enlevé le {sproduct}."),

source: no list
fr: (10,"Il n'y a pas de liste disponible."),(10,"Vous n'avez aucune liste en cours."),(10,"Il n'existe aucune liste."),(30,"Vous n'avez aucune liste. Vous devez en créer une nouvelle."),

source: known list
fr: (10, "Les listes existantes sont {slist}."),(10, "Les listes en cours sont {slist}."),(10, "Les listes actives sont {slist}."),(10, "Vous avez les listes suivantes {slist}."),(10, "Vous utilisez les listes suivantes {slist}."),

source: product in list
fr: (10, "La liste {slist} contient les produits suivants {sproduct}."),(10, "{slist} contient les produits suivants {sproduct}."),(10, "{slist} contient {sproduct}."),(10, "la liste {slist} contient {sproduct}."),

source: product added to the list
fr: (10, "Le produit a bien été ajouté sur la liste."),(10, "J'ai ajouté le produit."),(10, "J'ai ajouté {product}."),(10, "J'ai ajouté {product} sur la liste."),(10, "J'ai rajouté {product} sur la liste."),(10, "J'ai rajouté {product} sur la liste {slist}."),(10, "J'ai complété la liste {slist}."),(10, "J'ai complété la liste ."),(6, "C'est fait."),(6, "Je l'ai fait."),

source: no item
fr: (10, "Je n'ai pas compris le produit à ajouter."),(10, "Je n'ai pas compris le produit que vous vouliez ajouter."),
